Tekla Open API Reference for Tekla Structures 2025
DrawingItem Methods
The DrawingItem type exposes the following members.
Methods
Name | Description
Export
 Exports the drawing item in the catalog to given file name. If path is not given drawing is exported to model folder. If filename is empty drawing name is used as filename.
Select
 Selects the drawing item in the drawing catalog.
Top
See Also
Reference
DrawingItem Class
Tekla.Structures.Catalogs Namespace